spec/fixtures/refund_receipt.xml

<?xml version="1.0"?>
<RefundReceipt domain="QBO" sparse="false">
  <Id>2</Id>
  <SyncToken>0</SyncToken>
  <MetaData>
    <CreateTime>2014-04-24T15:15:42-07:00</CreateTime>
    <LastUpdatedTime>2014-04-24T15:15:42-07:00</LastUpdatedTime>
  </MetaData>
  <CustomField>
    <Name>Sales Rep</Name>
    <Type>StringType</Type>
    <StringValue>2435245</StringValue>
  </CustomField>
  <DocNumber>10030</DocNumber>
  <TxnDate>2014-04-24</TxnDate>
  <DepartmentRef name="Garden Services">1</DepartmentRef>
  <CurrencyRef name="United States Dollar">USD</CurrencyRef>
  <PrivateNote>This is a memo.</PrivateNote>
  <Line>
    <Id>1</Id>
    <LineNum>1</LineNum>
    <Description>Deck Lumber</Description>
    <Amount>345.00</Amount>
    <DetailType>SalesItemLineDetail</DetailType>
    <SalesItemLineDetail>
      <ItemRef name="Deck Lumber">34</ItemRef>
      <UnitPrice>23</UnitPrice>
      <Qty>15</Qty>
      <TaxCodeRef>TAX</TaxCodeRef>
      <ServiceDate>2014-04-24</ServiceDate>
    </SalesItemLineDetail>
  </Line>
  <Line>
    <Amount>345.00</Amount>
    <DetailType>SubTotalLineDetail</DetailType>
    <SubTotalLineDetail/>
  </Line>
  <TxnTaxDetail>
    <TxnTaxCodeRef>2</TxnTaxCodeRef>
    <TotalTax>22.43</TotalTax>
    <TaxLine>
      <Amount>22.43</Amount>
      <DetailType>TaxLineDetail</DetailType>
      <TaxLineDetail>
        <TaxRateRef>1</TaxRateRef>
        <PercentBased>true</PercentBased>
        <TaxPercent>6.5</TaxPercent>
        <NetAmountTaxable>345.00</NetAmountTaxable>
      </TaxLineDetail>
    </TaxLine>
  </TxnTaxDetail>
  <CustomerRef name="Candy Shop">64</CustomerRef>
  <CustomerMemo>memo!</CustomerMemo>
  <BillAddr>
    <Id>413</Id>
    <Line1>Mr. Adam Bradley</Line1>
    <Line2>Adam's Candy Shop</Line2>
    <Line3>1528 Kitty Bang Bang St.</Line3>
    <Line4>Fudge, CA 94555</Line4>
    <Lat>37.5677679</Lat>
    <Long>-122.0522177</Long>
  </BillAddr>
  <ShipAddr>
    <Id>414</Id>
    <Line1>Mr. Adam Bradley</Line1>
    <Line2>Adam's Candy Shop</Line2>
    <Line3>Adam's Candy Shop</Line3>
    <Line4>Adam Bradley</Line4>
    <Line5>1528 Kitty Bang Bang St.&#xD; Fudge, CA 94555</Line5>
    <Lat>37.5677679</Lat>
    <Long>-122.0522177</Long>
  </ShipAddr>
  <ClassRef name="Landscaping">100000000000368490</ClassRef>
  <TotalAmt>337.93</TotalAmt>
  <ApplyTaxAfterDiscount>false</ApplyTaxAfterDiscount>
  <PrintStatus>NeedToPrint</PrintStatus>
  <BillEmail>
    <Address>adam@gmail.com</Address>
  </BillEmail>
  <Balance>0</Balance>
  <PaymentMethodRef name="Check">9</PaymentMethodRef>
  <PaymentRefNum>To Print</PaymentRefNum>
  <DepositToAccountRef name="Checking">40</DepositToAccountRef>
</RefundReceipt>
